[
    {
        "teaserTitle": "Has digital got you out of balance",
        "teaser": "Too often companies look at digital only from the perspective of the customer engagement layer. Done right this perspective can provide very useful insights in your go-to-market strategy. Done wrong it will create imbalance that will at best slow you down and at worst worsen customer experience and negatively impact both brand and sales.",
        "articleTitle": "Digital Transformation and the problem of imbalance",
        "article": "<p>Too often companies look at digital only from the perspective of the customer engagement layer. Done right this perspective can provide very useful insights in your go-to-market strategy. Done right it absolutely will be driven from the perspetive of the customer. Done right it will look at all channels of engagement. Done wrong it will create imbalance that will at best slow you down and at worst worsen customer experience and negatively impact both brand and sales.</p><p>The allure of the online channel is its visual nature, its ready comparison with the competition and its resonance with feedback from customers. Even seasoned digital strategists can get sucked into this honey trap.</p><p>This imbalance can felt in a number of ways; here are three:</p><ul><li><strong>A focus on how work is entering your organisation</strong> at the expense of how work is managed and value is created and delivered. Process engineering 101 will teach you that simply shoving work into the pipeline won&apos;t result in faster or better output - most likely the opposites.</li><li><strong>A focus on the obviously digital channels</strong> at the expense of the traditional channels like phone and face-to-face. It&apos;s common to think about multi- or omni-channel. It&apos;s less common to consider how to digitise these traditional channels to improve customer experience.</li><li><strong>A focus on what works for the customer</strong> at the expense of what works for the organisation. Those that drink too much of the &apos;customer led&apos; kool-aid can often forget that a business is fundamentally self-serving; perhaps I should say stakeholder-serving. (Conversely, those that baulk at the mantra of customer centricity may have lost sight of the fact that without customers the business dies.) A channel strategy must map touchpoints to &apos;best channel for customer&apos; and &apos;best channel for business&apos;; it&apos;s great when these align and a decision is needed when mis-aligned.</li></ul><blockquote>Digital transformation is multi-faceted.</blockquote><p>Responding to the unique challenges of the digital age is a wicked problem. This makes making sense of it a real challenge. So it makes sense to use experienced people who understand its complexity to work with your staff who understand your business to create a winning strategy.</p>"
    },
    {
        "teaserTitle": "Jobs in the digital age",
        "teaser": "People are enabled by technology. It is so in this second machine age as much as in the first. Technology developments will change jobs for the better. Look for people-machine collaborative opportunities.",
        "articleTitle": "The machines are coming for our jobs",
        "article": "<p>When I tell people that I work with companies to become more digitalised the response is often of the form, \"Oh, you want people to lose their jobs.\" In 1997 world chess champion Kasparov was defeated by a computer. A formative milestone in the human-machine evolution had been passed; a computer had beaten a human mind - not just any mind; one of the best.</p><p>For Kasparov this was a turning point too. He invented Advanced Chess in which each competitor is a team of humans and computers - collaboration over competition. Just as a human on a bicycle is more efficient than a human walking, so a human with a computer is enhanced to a level far greater than either could achieve in isolation.</p><blockquote>Human-machine groups more efficient and reduce human idle time by 80% (MIT)</blockquote><p>The nature of work will change. There will be a shift towards the service sector, for example. Society will change too. Changes such as basic income leading to greater overall innovation as the risk of trying something new is reduced. There is no shortage of work that humans can do.</p><p>Together with smart-machines we will do more than we have ever been able to do before. This is why I do what I do.</p>"
    }
]